import os

################################################################
#                     1    查看系统环境变量                      #
################################################################
choose = False
if choose:
    result = os.getenv('path')
    all_path = result.split(';')
    for i, path in enumerate(all_path):
        print(path)

################################################################
#                     2    增加系统环境变量                      #
################################################################
choose = False
if choose:
    os.putenv('path', '目录')
# 注意：putenv只能增加python复制的环境变量，系统的环境变量修改不了

################################################################
#                     3    展示系统环境变量                      #
################################################################
print(os.environ['path'])
# 展示环境变量

################################################################
#                     4    添加系统环境变量                      #
################################################################
os.environ['path'] = os.environ['path']+';'+'欲添加的环境变量'
